'''
В Python, int (сокращение от "integer") - это класс данных, представляющий целые числа. 
Целые числа включают в себя как положительные, так и отрицательные значения, а также ноль. 
Они могут быть использованы для математических операций, счетчиков, индексации и многих других целей.
'''

#Примеры целых чисел:

x = 5       # положительное целое число ( >0 )
y = -10     # отрицательное целое число ( <0 )
z = 0       # ноль

#Вы можете выполнять различные математические операции с целыми числами, такие как сложение, вычитание, умножение и деление:
a = 10
b = 3

sum_result = a + b     # 13 сложить
subtraction_result = a - b  # 7 вычесть
multiplication_result = a * b  # 30  умножить
division_result = a / b    # 3.3333333333333335 (вещественное число)  разделить

# Целые числа в Python могут быть использованы для представления широкого диапазона значений и используются в различных аспектах программирования, 
# включая арифметические операции, счетчики циклов и индексы в списках и кортежах.

print(x,y,z)

print(f'\na = {a}, b = {b}\nsum_result = {sum_result}\nsubtraction_result = {subtraction_result}\nmultiplication_result = {multiplication_result}\ndivision_result = {division_result}')





