'''
Задача 24: В фермерском хозяйстве в Карелии выращивают чернику. Она растет на круглой грядке, причем кусты высажены только по окружности. Таким образом, у
каждого куста есть ровно два соседних. Всего на грядке растет N кустов. Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них
выросло различное число ягод – на i-ом кусте выросло ai ягод. В этом фермерском хозяйстве внедрена система автоматического сбора черники.
Эта система состоит из управляющего модуля и нескольких собирающих модулей. Собирающий модуль за один заход, находясь непосредственно перед некоторым
кустом, собирает ягоды с этого куста и с двух соседних с ним. Напишите программу для нахождения максимального числа ягод, которое может
собрать за один заход собирающий модуль, находясь перед некоторым кустом заданной во входном файле грядки.
4 -> 1 2 3 4
9
'''
import random
n = int(input('Введите кол-во кустов на грядке: '))
my_list = [random.randint(0, 10) for i in range(n)]
print(f'Кусты: {my_list}')

count = 0
for i in range(n):
    sum = my_list[i] + my_list[i - 1] + my_list[i + 1 if i < n - 1 else 0]
    if sum > count:
        count = sum
    print(f'{my_list[i - 1]} + {my_list[i]} + {my_list[i + 1 if i < n - 1 else 0]} = {sum}') 
print(f'Максимально ягод можно собрать: {count}')